content/main/20211005121901-principle.md
+++
title = "principle"
author = ["System Administrator"]
draft = false
+++

**Principles** are guidelines drew from recognition of `if...then...` or `cause and effect relationship`.
Upon such recognition, the way leads to ideal condition becomes **Principles** and should be recorded


## Formation {#formation}

from `errors` and `experiances` comes `facts`.
`Facts` contains `decision` and `result`
from personal belief and reality comes `goals`, `of choice` or `of performance`.
`goals` contains `specific goal` and `requirement`
an act `with principle` make decisions on what strategy/thing to do **base on reality, look to goals**. That is, in combination of `requirement` and `result`, referencing the `decisions`

When patterns are `recognized` and `reasoned`, `stated principle` may be addressed. They, however, could be dangerous while helpful, so must be treated with care, including double check on their `reality image`, `goal hierachy` or `reason`. Don't let them mislead you to a god-knows-where direction.


## A detailed log {#a-detailed-log}

[2022-02-19]({{< relref "../daily/2022-02-19.md" >}}) Morning page


## A collection {#a-collection}


### Accumulation works, burst don't {#accumulation-works-burst-don-t}

Burst sometimes do a lot. But it happens randomly, making it imposible to count on. And that's of creation.

Of learning, Accumulation totally beat burst.


### 09:37 PM - Take one each time <span class="tag"><span class="principle">principle</span></span> {#09-37-pm-take-one-each-time}

Should not walk into work without principle.

To keep awareness, at least one principle should be taken into the work.

To test principles, should test a new principle each time.


### jump in without doc/blackbox would result in blindness <span class="tag"><span class="task">task</span><span class="general">general</span><span class="principle">principle</span><span class="untested">untested</span></span> {#jump-in-without-doc-blackbox-would-result-in-blindness}

I have it derived from my prior experiance of clojure. Basically, I went through everything, but ended up very blind about what I went through.

Also, when trying out and writing code, jumpping in only kept me up with the code for about half page. I can't remember what I had written. Graph/outline with doc would be very good aid.


### Sleep before ten if tomorow is to work <span class="tag"><span class="principle">principle</span><span class="untested">untested</span><span class="life">life</span><span class="performance">performance</span></span> {#sleep-before-ten-if-tomorow-is-to-work}

This should be accompanied with proper work-out. If not having my energy used, it can be hard to go to sleep.


#### fact {#fact}

If I sleep later than 23:00, I mostly get up with depressed mood around noon. The work could start at late afternoon, or not at all.

If I'm all on myself, and want to do meaningful work the other day, sleep early would be nice.


#### goal {#goal}

This boost my performance of everything.


### Always state principle with clear image <span class="tag"><span class="principle">principle</span><span class="untested">untested</span></span> {#always-state-principle-with-clear-image}

Principle without clear image have no relation to fact/reality, making it unreliable.